tutorials/steadyStateForcedConvection4NFFoam/pipeMonoHeterogeneous/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 1 -1 0 0 0 0];

internalField		uniform (0.143935689 0 0);

boundaryField
{
    inlet
    {
	type		parabolicRadialVelocity4NFFoam;
        Vm              (0.143935689);
        R               0.003;
        longDir         (1 0 0);

    }

    outlet
    {
	type		zeroGradient;
    }

    tubeWall
    {
	type		fixedValue;
	value		uniform (0 0 0);
    }
}


// ************************************************************************* //
